Tekla.Structures.Model.BasePoint.IsScopedCurrentBasePoint
Gets or sets the value indicating whether this base point is the scoped current base point.

Tekla.Structures.Model.BasePoint.ConvertFromBasePoint(Tekla.Structures.Geometry3d.Point)
Converts the given this base points point to local point.
point: The point to be converted.
Returns: On success, the converted value. Otherwise the original value.